---
kind: method
id: M:Autodesk.Revit.UI.UIView.Close
source: html/c60046d1-6fbd-6fc1-6f09-0aecdb3a7fe9.htm
---
# Autodesk.Revit.UI.UIView.Close Method

Closes the view.

## Syntax (C#)
```csharp
public void Close()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Cannot close a project's only open view.